Revit 2027 API
RebarBendData.HookLength0 Property
 The extension length of the hook at the start. The default value is 0.0.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double HookLength0 { get; set; }
Public Property HookLength0 As Double
	Get
	Set
public:
property double HookLength0 {
	double get ();
	void set (double value);
}
member HookLength0 : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The given value for hookLength0 is not finite
See Also
Reference
RebarBendData Class
Autodesk.Revit.DB.Structure Namespace